       IDENTIFICATION DIVISION.
       PROGRAM-ID. TestProgram

       DATA DIVISION.
       WORKING-STORAGE.

       01 Number1 PIC 9(1) VALUE 0.
       01 Number2 PIC 9(1) VALUE 0.
       01 SumResult PIC 9(2) VALUE 0.

       PROCEDURE DIVISION.
